ERP.belugaerp/src/InformationRegisters/бг_СоответствиеВидовДоставкиОтПоставщиков/бг_СоответствиеВидовДоставкиОтПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_СоответствиеВидовДоставкиОтПоставщиков</name>
  <resources>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.бг_ВидыПеревозки</types>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДлительностьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_СоответствиеВидовДоставкиОтПоставщиков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВидДоставкиОтПоставщика(Поставщик, Склад, ДлительностьДоставки) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыДоставкиОтПоставщиков.ВидПеревозки КАК ВидПеревозки
	|ИЗ
	|	РегистрСведений.бг_СоответствиеВидовДоставкиОтПоставщиков КАК ВидыДоставкиОтПоставщиков
	|ГДЕ
	|	ВидыДоставкиОтПоставщиков.Поставщик = &Поставщик
	|	И ВидыДоставкиОтПоставщиков.Склад = &Склад
	|	И ВидыДоставкиОтПоставщиков.ДлительностьДоставки = &ДлительностьДоставки";
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ДлительностьДоставки", ДлительностьДоставки);
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидПеревозки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
